dataset_gen/NS_datasets_16/FPO_cylinder/Irregular/Design_Point_0/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16128
(
(0.0078125 0.0078125 0.05)
(0.0234375 0.0078125 0.05)
(0.0390625 0.0078125 0.05)
(0.0546875 0.0078125 0.05)
(0.0703125 0.0078125 0.05)
(0.0859375 0.0078125 0.05)
(0.101562 0.0078125 0.05)
(0.117188 0.0078125 0.05)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 0.0078125 0.05)
(0 0.0234375 0.05)
(0 0.0390625 0.05)
(0 0.0546875 0.05)
(0 0.0703125 0.05)
(0 0.0859375 0.05)
(0 0.101562 0.05)
(0 0.117188 0.05)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(2 0.0078125 0.05)
(2 0.0234375 0.05)
(2 0.0390625 0.05)
(2 0.0546875 0.05)
(2 0.0703125 0.05)
(2 0.0859375 0.05)
(2 0.101562 0.05)
(2 0.117188 0.05)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.0078125 0 0.05)
(0.0234375 0 0.05)
(0.0390625 0 0.05)
(0.0546875 0 0.05)
(0.0703125 0 0.05)
(0.0859375 0 0.05)
(0.101562 0 0.05)
(0.117188 0 0.05)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.0078125 2 0.05)
(0.0234375 2 0.05)
(0.0390625 2 0.05)
(0.0546875 2 0.05)
(0.0703125 2 0.05)
(0.0859375 2 0.05)
(0.101562 2 0.05)
(0.117188 2 0.05)
...
)
;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0.882812 0.875 0.05)
(0.898438 0.875 0.05)
(0.914062 0.875 0.05)
(0.929688 0.875 0.05)
(0.945313 0.875 0.05)
(0.960937 0.875 0.05)
(0.976562 0.875 0.05)
(0.992187 0.875 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
